20230820050529-scripting.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-02 Mon 08:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Scripting</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Scripting</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0021dc4">1. Scripting</a>
<ul>
<li>
<ul>
<li><a href="#orgb71d622">1.0.1. Scripting:</a></li>
</ul>
</li>
<li><a href="#org4c44799">1.1. Basic automation</a></li>
<li><a href="#org27f9dd6">1.2. Restarting machines</a></li>
<li><a href="#orgdd49e48">1.3. Mapping network drives</a></li>
<li><a href="#orga6e39b1">1.4. Installing applications</a></li>
<li><a href="#orge29b20a">1.5. Automated Backups</a></li>
<li><a href="#org2ed3920">1.6. Gathering of information and data</a></li>
<li><a href="#org494d8ec">1.7. Initiating Updates</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org0021dc4" class="outline-2">
<h2 id="org0021dc4"><span class="section-number-2">1.</span> Scripting</h2>
<div class="outline-text-2" id="text-1">
<p>
Programming language that is used to <b>manipulate</b>, <b>customize</b>, and <b>automate</b> the facilities of an existing system.
</p>

<p>
Scripting languages are usually <a href="20230820052506-interpreted_programming_languages.html#ID-bf416986-69aa-48e4-a84b-89aa06d16f2e">Interpreted</a> at runtime rather than <a href="20230820051907-compiled_programming_languages.html#ID-60d16def-55c3-4f88-98c4-b9b6382fad00">Compiled</a>.
</p>

<ul class="org-ul">
<li><a href="20230819062442-windows.html#ID-45bb23df-e29d-46dc-b704-f17cf26af1d7">Windows</a> environments: batch scripts <code>(.bat)</code>, Powershell <code>(.ps1)</code>, Visual Basic Script <code>(.vbs)</code></li>
<li><a href="20230820050717-linux_unix.html#ID-a5441999-e7a7-4034-b996-cfc8462989ed">Linux/Unix</a> environments: Shell scripts <code>(.sh)</code></li>
<li>Most <a href="20230819045220-operating_systems.html#ID-1dcff204-74cf-445d-9357-5c01ca3d2a03">OS</a> environments: javascript <code>(.js)</code>, Python <code>(.py)</code></li>
</ul>
</div>

<div id="outline-container-orgb71d622" class="outline-4">
<h4 id="orgb71d622"><span class="section-number-4">1.0.1.</span> Scripting:</h4>
</div>
<div id="outline-container-org4c44799" class="outline-3">
<h3 id="org4c44799"><span class="section-number-3">1.1.</span> Basic automation</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Python is an excellent script for automation.
It’s one of the most commonly used, with many available automation libraries.
</p>
</div>
</div>

<div id="outline-container-org27f9dd6" class="outline-3">
<h3 id="org27f9dd6"><span class="section-number-3">1.2.</span> Restarting machines</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Many power users use PowerShell (.ps1) scripts to restart machines (Windows). For Linux machines, they can use .sh (shell) scripts.
</p>
</div>
</div>

<div id="outline-container-orgdd49e48" class="outline-3">
<h3 id="orgdd49e48"><span class="section-number-3">1.3.</span> Mapping network drives</h3>
<div class="outline-text-3" id="text-1-3">
<p>
In the past, mapping network drives was accomplished with <code>.bat</code> or <code>.vbs</code> scripts.
</p>

<p>
However, <code>PowerShell</code> scripts are most commonly used to map drives in <code>Windows</code> environments today.
</p>

<p>
For Linux users, <code>shell scripts</code> can be used for this purpose.
</p>
</div>
</div>

<div id="outline-container-orga6e39b1" class="outline-3">
<h3 id="orga6e39b1"><span class="section-number-3">1.4.</span> Installing applications</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<code>Batch file</code> and <code>shell scripts</code> are often used for automated software installation.
</p>
</div>
</div>

<div id="outline-container-orge29b20a" class="outline-3">
<h3 id="orge29b20a"><span class="section-number-3">1.5.</span> Automated Backups</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Windows <code>PowerShell</code> and Linux/Unix <code>shell scripts</code> can automate backups.
</p>
</div>
</div>

<div id="outline-container-org2ed3920" class="outline-3">
<h3 id="org2ed3920"><span class="section-number-3">1.6.</span> Gathering of information and data</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Python is a popular choice for gathering data.
</p>

<p>
Python has many available libraries to help with this task.
</p>
</div>
</div>

<div id="outline-container-org494d8ec" class="outline-3">
<h3 id="org494d8ec"><span class="section-number-3">1.7.</span> Initiating Updates</h3>
<div class="outline-text-3" id="text-1-7">
<p>
<code>Powershell</code> and <code>shell</code> scripts can be used for initiating updates in Windows and Linux, respectively.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
